start = """
سلام به ربات طرحینو خوش آمدید.
""".strip()

help_reg = """
🎨 خلق آثار جذاب، ساده‌تر از همیشه!

این ربات تلگرام به شما کمک می‌کند تا پوسترها، کارت‌های تبریک و محتوای چندرسانه‌ای دلخواهتان را به راحتی و با طرح‌های متنوع ایجاد کنید.

✨ امکانات ربات:
✔️ طراحی عکس‌نوشت با متن، تصویر و سبک دلخواه
✔️ پیشنهاد عنوان‌های جذاب برای پوسترها با کمک هوش مصنوعی
✔️ ارائه ایده‌ها و عکس‌های متنوع برای الهام گرفتن
✔️ امکان ساخت چندین پوستر به‌صورت همزمان

با این ربات، خلاقیت خود را شکوفا کنید و بدون نیاز به مهارت طراحی، محتوای حرفه‌ای بسازید! 🚀
""".strip()

give_name = """
لطفا نام و نام‌خانوادگی خود را وارد کنید.
""".strip()

give_name_with_default = """
نام شما بر اساس اطلاعات ثبت‌شده در بله {name} تعیین شده است.

اگر مورد تأیید شماست، روی گزینه "مقدار پیش‌فرض" کلیک کنید. در غیر این صورت، نام دلخواه خود را وارد نمایید.
""".strip()

needs_registration = """
سلام به ربات طرحینو خوش آمدید.
شما هنوز ثبت‌نام نکردید.
لطفا از منو پایین روی گزینه ثبت‌نام کلیک کنین.
""".strip()

give_phone_number = """
شماره تلفن همراه خود را وارد کنید. 
به طور مثال:
09131234567
""".strip()

invalid_value = """
مقدار مورد نظر معتبر نیست.
""".strip()

main_menu = """
به منوی اصلی خوش آمدید.
""".strip()

setting_menu = """
تنظیمات اکانت جایی است که میتوانید فونت، رنگ‌بندی قالب‌های مخصوص خودتان را ببینید و یا تغییر دهید.

از میان گزینه‌های زیر یکی را انتخاب کنید.
""".strip()

font_menu = """
فونت فعلی شما: {font} می‌باشد. 

شما می‌توانید یکی از فونت های زیر را انتخاب کنید.
""".strip()

color_menu = """
تمپلیت رنگی شما به این صورت می‌باشد. 

در صورت نیاز می‌توانید هر کدام از موارد را تغییر دهید.
""".strip()

give_color = """
برای تغییر رنگ باید یک کد رنگی را پرای ربات ارسال کنید 
به عنوان مثال میتوانید وارد سایت 
https://ircolor.ir/
بشوید و رنگ مورد نظر خود را انتخاب کنید
در مرجله بعد یک کد رنگی که با # شروع میشود میبینید 
(شبیه این #467edd )
آن کد را برای ربات ارسال کنید.


لطفاً رنگ جدید برای {color_name} را ارسال کنید.
""".strip()

ok_status = """
باموفقیت انجام شد.
""".strip()


none_state = """
به دلیل کارنکردن زیاد با بازو شما به منو اصلی منتقل شده‌اید.
""".strip()

try_again = """
لطفا دوباره امتحان کنین.
""".strip()

error = """
برنامه دچار مشکل شده است.
{error_msg}
""".strip()

user_profile = """
نام: {name}
شماره همراه: {phone_number}
""".strip()

template_selection = """
طرح موردنظر خود را انتخاب کنید.
"""

start_message = "لطفاً یکی از گزینه‌های زیر را انتخاب کنید:"

orientation = "جهت مدنظر خود را برای طرح انتخاب کنید:"

initial_image = "تصویری که قصد دارید در پوستر قرار گیرد را ارسال کنید."

not_valid_length = """
طول عبارت وارد شده طولانی‌تر از مقدار مجاز است.
""".strip()

places = """
لطفا یکی از موارد زیر را جهت نمایش اطلاعات بیشتر انتخاب نمایید.👇👇
""".strip()


completed_poster = "فایل نهایی آماده است."

poster_details = """
عنوان: {title}
متن خبر: {message_text}
جهت: {orientation}
خروجی: {output_image}
""".strip()

mode_selection = """ روش مدنظر خود را انتخاب کنید."""

type_selection = """از بین دسته طرح های زیر انتخاب کنید:"""

heading1_message_with_default = """
عنوان "{title}" به کمک هوش مصنوعی برای متن شما تشخیص داده شده است. در صورت تایید روی گزینه "تایید عنوان پیش‌فرض" کلیک کنید.

در غیر این صورت عنوان پیشنهادی خود را وارد کنید.
""".strip()


def generate_heading1_message(poster_type):
    if poster_type == "basic":
        return "عنوان متن را وارد کنید: (حداکثر ۱۰ کلمه) "
    if poster_type == "postcard":
        return "نام گیرنده کارت‌پستال را وارد کنید: "
    if poster_type == "invitation":
        return "نام گیرنده دعوت‌نامه را وارد کنید: "

def generate_group_heading1_message(poster_type):
    if poster_type == "postcard":
        return "لیست اسامی گیرندگان کارت‌پستال را بصورت یک فایل اکسل وارد کنید: "
    if poster_type == "invitation":
        return "لیست اسامی گیرندگان دعوت‌نامه را بصورت یک فایل اکسل وارد کنید: "


def generate_heading2_message(poster_type):
    if poster_type == "basic":
        return "متن اصلی را وارد کنید: (حداکثر ۲۰ کلمه)"
    if poster_type == "postcard":
        return " متن کارت‌پستال را وارد کنید: "
    if poster_type == "invitation":
        return " متن دعوت‌نامه را وارد کنید: "
